Core/src/src/AccumulationRegisters/РезервированиеЗапасов/РезервированиеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервированиеЗапасов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>CatalogRef.Контрагенты</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/AccumulationRegisters/РезервированиеЗапасов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) ЭКСПОРТ
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	ВыполнитьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства);
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияРезервированиеЗапасовИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

Процедура ВыполнитьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) ЭКСПОРТ

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РезервированиеЗапасов.НомерСтроки КАК НомерСтроки,
	|	РезервированиеЗапасов.Организация КАК Организация,
	|	РезервированиеЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	РезервированиеЗапасов.Документ КАК Документ,
	|	РезервированиеЗапасов.Номенклатура КАК Номенклатура,
	|	РезервированиеЗапасов.Характеристика КАК Характеристика,
	|	РезервированиеЗапасов.Партия КАК Партия,
	|	РезервированиеЗапасов.Проект КАК Проект,
	|	РезервированиеЗапасов.Количество КАК КоличествоПередЗаписью,
	|	РезервированиеЗапасов.Количество КАК КоличествоИзменение,
	|	РезервированиеЗапасов.Количество КАК КоличествоПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРезервированиеЗапасовИзменение
	|ИЗ
	|	РегистрНакопления.РезервированиеЗапасов КАК РезервированиеЗапасов");
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
